package com.lpz.ussd.enums;

/**
 * CommandStatus字段表示一个USSD业务应用协议消息成功或出错的状态，不使用该字段的消息应将该字段置为NULL。
 * 
 * @author lpz
 *
 */
public enum UssdCommandStatus {

	CODE_0(0, "无错误"), CODE_1(1, "未知用户"), CODE_2(2, "未知的基站"), CODE_3(3, "未知MSC"), CODE_4(4, "未知的小区"), CODE_5(5, "未识别用户"),
	CODE_6(6, "未分配漫游号码"), CODE_7(7, "未知设备"), CODE_8(8, "漫游不被允许"), CODE_9(9, "非法移动台"), CODE_10(10, "承载业务未被提供"),
	CODE_11(11, "电信业务未被提供"), CODE_12(12, "无足够的承载能力或者非法设备"), CODE_13(13, "呼叫已被禁止"), CODE_14(14, "前传冲突"),
	CODE_15(15, "CUG（闭合用户群补充业务）拒绝"), CODE_16(16, "非法的补充业务操作"), CODE_17(17, "补充业务错误状态"), CODE_18(18, "补充业务不可用"),
	CODE_19(19, "补充业务预约冲突"), CODE_20(20, "补充业务不兼容"), CODE_21(21, "厂家未支持"), CODE_23(23, "无效的目的基站"),
	CODE_24(24, "无可用的无线资源"), CODE_25(25, "没有可用的切换号码"), CODE_26(26, "后续的切换失败"), CODE_27(27, "缺席用户"), CODE_29(29, "用户忙"),
	CODE_30(30, "无线拥塞"), CODE_31(31, "呼叫不可完成或MT短消息用户忙"), CODE_32(32, "短消息传送失败"), CODE_33(33, "消息等待队列满"),
	CODE_34(34, "系统失败"), CODE_35(35, "数据丢失"), CODE_36(36, "不期望的数值"), CODE_37(37, "口令注册失败"), CODE_38(38, "口令检查未通过"),
	CODE_39(39, "无可用的漫游号码"), CODE_40(40, "跟踪缓冲区满"), CODE_43(43, "PW尝试次数冲突"), CODE_44(44, "MAP号码已经改变"),
	CODE_50(50, "移动台中的错误"), CODE_51(51, "短消息低层能力未提供"), CODE_52(52, "内存已满"), CODE_53(53, "短消息中心拥塞"),
	CODE_54(54, "移动台不是短消息中心的注册用户"), CODE_55(55, "无效的SME地址"), CODE_56(56, "没有参数的缺席用户"), CODE_253(253, "创建会话失败"),
	CODE_254(254, "MS泄漏"), CODE_256(256, "该号码已存在一个会话"), CODE_1001(1001, "帐号没有找到或者不存在"), CODE_1002(1002, "帐号类型无效"),
	CODE_1003(1003, "该帐号当前BIND的用户数太多"), CODE_1004(1004, "该帐号已经存在"), CODE_1005(1005, "该帐号不存在"),
	CODE_1006(1006, "修改的帐号内容与现有帐号冲突"), CODE_1007(1007, "该帐号还有用户在使用"), CODE_1008(1008, "已达到系统最大帐号数"),
	CODE_1009(1009, "无效的口令"), CODE_1010(1010, "业务数目过多（已超过系统所支持的业务数）"), CODE_1011(1011, "已达到系统最大接口数"),
	CODE_1012(1012, "业务类型找不到"), CODE_1013(1013, "无效的业务码"), CODE_1014(1014, "找不到指定接口"),
	CODE_1015(1015, "不能对OMC Server接口"), CODE_1016(1016, "不能对接口本身进行监视"), CODE_1017(1017, "超出最大允许的任务数"),
	CODE_1018(1018, "找不到指定的任务"), CODE_1019(1019, "超出最大允许的统计任务数目"), CODE_1020(1020, "USSD会话个数已超过系统极限值"),
	CODE_1021(1021, "找不到USSD会话"), CODE_1022(1022, "USSD串格式错误"), CODE_1023(1023, "USSD实体已从UssdServer中退出"),
	CODE_1024(1024, "业务切换失败"), CODE_1025(1025, "未加载完用户就收到END_LOAD_USER消息"), CODE_1026(1026, "用户加载器已存在"),
	CODE_1027(1027, "超出最大开户请求数"), CODE_1028(1028, "超出最大用户数"), CODE_1029(1029, "该用户已存在"), CODE_1030(1030, "该用户不存在"),
	CODE_1031(1031, "包内容不正确或被破坏"), CODE_1032(1032, "创建失败（通常指内存不足）"), CODE_1033(1033, "无足够的权限"), CODE_1034(1034, "超时错误"),
	CODE_1035(1035, "参数错误（如参数值越界，参数格式不对等）"), CODE_1036(1036, "内部错误"), CODE_1037(1037, "Server配置信息过多"),
	CODE_1038(1038, "未找到Server配置"), CODE_1039(1039, "Server已经存在"), CODE_1040(1040, "存储Server配置的文件不存在"),
	CODE_1041(1041, "Snapshot已经存在"), CODE_1042(1042, "没找到该Snapshot"), CODE_1043(1043, "路由表中找不到业务码"),
	CODE_1044(1044, "路由表中没有该帐号的绑定信息"), CODE_1045(1045, "还没有接口绑定到号段"), CODE_1046(1046, "不是一个业务帐号"),
	CODE_1047(1047, "帐号没有支持任何业务"), CODE_1048(1048, "号段没有找到"), CODE_1049(1049, "无此种鉴权方式"), CODE_1050(1050, "鉴权失败"),
	CODE_1051(1051, "查询线程信息失败"), CODE_1052(1052, "未找到接口"), CODE_1053(1053, "未知错误"), CODE_1054(1054, "Server类型非法"),
	CODE_1055(1055, "消息不带手机号并且根据IMSI找不到手机号"), CODE_1056(1056, "接口已经被强制阻塞"), CODE_1057(1057, "整个会话超时"),
	CODE_1058(1058, "超过最大的SCP帐号数目(200)"), CODE_1059(1059, "SCP帐号已经存在"), CODE_1060(1060, "SCP帐号不存在"),
	CODE_1061(1061, "SCP帐号下存在接口,不能修改"), CODE_1062(1062, "SCP帐号的IP地址和端口已经存在"), CODE_1063(1063, "修改的帐号信息与现有帐号冲突"),
	CODE_1064(1064, "超过SCP帐号最大接口数目"), CODE_1065(1065, "SCP接口不存在"), CODE_1066(1066, "scp帐号中以该登录帐号登录的接口已经存在"),
	CODE_1067(1067, "删除SCP接口错误"), CODE_1068(1068, "无效的SCP接口参数"), CODE_1069(1069, "创建SCP接口失败"),
	CODE_1070(1070, "删除PPS号段表错误"), CODE_1071(1071, "添加PPS号段表错误"), CODE_1072(1072, "修改PPS号段表错误"),
	CODE_1073(1073, "PPS号段不存在"), CODE_1074(1074, "PPS路由未找到"), CODE_1075(1075, "PPS号段已经存在"),
	CODE_1076(1076, "在SCP收取通信费时返回计费失败"), CODE_1077(1077, "在SCP收取消息费时返回计费失败"), CODE_1078(1078, "和SCP之间的连接发生断连"),
	CODE_1079(1079, "等待SCP返回计费响应超时"), CODE_1080(1080, "非PPS用户"), CODE_1081(1081, "鉴权时查找路由失败"),
	CODE_1082(1082, "鉴权时查找业务失败"), CODE_1083(1083, "鉴权时查找用户失败"), CODE_1084(1084, "MS非法操作 "), CODE_1085(1085, "SP重复计费"),
	CODE_1086(1086, "PPS用户"), CODE_1087(1087, "业务码在使用"), CODE_1088(1088, "会话达到最大交互次数"), CODE_1089(1089, "会话转移失败"),
	CODE_1090(1090, "非法手机号");

	private int code;
	private String msg;

	private UssdCommandStatus(int code, String msg) {
		this.code = code;
		this.msg = msg;
	}

	public int getCode() {
		return code;
	}

	public String getMsg() {
		return msg;
	}

	public static UssdCommandStatus getEnumByCode(int code) {
		for (UssdCommandStatus c : UssdCommandStatus.values()) {
			if (c.getCode() == code) {
				return c;
			}
		}
		return null;
	}

	public static String getMsgByCode(int code) {
		for (UssdCommandStatus c : UssdCommandStatus.values()) {
			if (c.getCode() == code) {
				return c.getMsg();
			}
		}
		return null;
	}

}
